application/app/Http/Controllers/Emails.php

update `users` set `app_password` = 'kfcznbzufvxsynzg', `users`.`updated` = '2025-01-28 11:34:10' where `id` = 3
---
    public function updateAppPassword(Request $request)
    {
        // Validate the request
        $request->validate([
            'app_password' => 'required',
        ]);

        // Get the authenticated user
        $user = Auth::user();

        // Save the app password directly
        $user->app_password = $request->app_password;
        $user->save();

select exists(select * from `emails` where `uid` = 9180) as `exists`
---
    public function fetchEmails($fromCommand = false)
    {
        try {

            if ($fromCommand) {
                return true; // Return true for command line execution
            }

            // Connect to the IMAP server
            $client = Client::account('default');
            $client->connect();

            // Access the INBOX folder
            $folder = $client->getFolder('INBOX');

            // Fetch unseen messages
            $messages = $folder->query()
                ->since(now()->subDays(1)) // Emails from the last day
                ->unseen()
                ->limit(5)
                ->setFetchOrder("desc")
                ->get();



            foreach ($messages as $message) {
                $uid = $message->getUid();

                // Check if email with this UID already exists
                if (!Email::where('uid', $uid)->exists()) {

insert into `emails` (`uid`, `subject`, `from`, `body`, `logistics_data`, `received_at`, `email_to`, `request_type`, `quantity`, `shipping_date`, `shipping_time`, `shipper_name`, `shipper_country`, `shipper_city`, `shipper_address`, `pickup_remarks`, `shipping_carrier`, `transport_mode`, `container_type`, `cargo_weight_kg`, `cargo_type`, `origin`, `destination`, `delivery_date`, `delivery_time`, `consignee_name`, `consignee_country`, `consignee_city`, `consignee_address`, `delivery_remarks`, `carrier_for_delivery`, `temperature_sensitive`, `temperature_range`, `adr`, `un_code`, `fragile`, `notes`, `chargeable_weight`, `ticket_user_id`, `updated_at`, `created_at`) values (9191, '{}', 'ubldigital@ubl.com.pk', '', '', '2025-01-27 23:52:13', 'ALIZEESHAN14323@GMAIL.COM', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '2025-01-28 11:32:36', '2025-01-28 11:32:36')
---
                    $logisticsData = $this->getNLPData($emailBody);

                    // Save the email to the database
                    $email = Email::create([
                        'uid'           => $uid,
                        'subject'       => $message->getSubject() ?? 'No Subject',
                        'from'          => $message->getFrom()[0]->mail ?? 'Unknown Sender',
                        'body'          => $emailBody,
                        'logistics_data' => $logisticsData ? json_encode($logisticsData) : null,// Store the filtered logistics data
                        'received_at'   => $message->getDate(),
                        'email_to'=>$message->getTo()[0]->mail ?? 'Unknown Sender',
                        // Save logistics data directly in the emails table
                'request_type' => $logisticsData['request_type'] ?? null,
                'quantity' => $logisticsData['quantity'] ?? null,
                'shipping_date' => $logisticsData['shipping_date'] ?? null,
                'shipping_time' => $logisticsData['shipping_time'] ?? null,
                'shipper_name' => $logisticsData['shipper_name'] ?? null,
                'shipper_country' => $logisticsData['shipper_country'] ?? null,
                'shipper_city' => $logisticsData['shipper_city'] ?? null,
                'shipper_address' => $logisticsData['shipper_address'] ?? null,
                'pickup_remarks' => $logisticsData['pickup_remarks'] ?? null,
                'shipping_carrier' => $logisticsData['shipping_carrier'] ?? null,
                'transport_mode' => $logisticsData['transport_mode'] ?? null,
                'container_type' => $logisticsData['container_type'] ?? null,

select * from `emails` where `email_to` = 'alizeeshan14323@gmail.com' order by `received_at` desc
---
                // dd($userEmail);
            // Fetch saved emails from the database to send to the view
            // $savedEmails = Email::latest('received_at')->get();
            $savedEmails = Email::where('email_to', $userEmail)
            ->latest('received_at')
            ->get();

select * from `emails` where `emails`.`id` = '79' limit 1
---
    public function show($emailId)
{
    // Fetch the email data based on the ID
    $email = Email::findOrFail($emailId);

select * from `users` where `type` = 'team'
---
    $orderTypes         = $responses['orderTypes']?? null;
    $orderStatus        = $responses['orderStatus']?? null;
    $incoterms          = $responses['incoterms']?? null;
    $teamUsers = \App\Models\User::where('type','team')->get();