application/app/Http/Controllers/Tickets.php

    public function index(CategoryRepository $categoryrepo) {

        //get tickets
        $tickets = $this->ticketrepo->search();

        //get all categories (type: ticket) - for filter panel
        $categories = $categoryrepo->get('ticket');

        //statuses
        $statuses = \App\Models\TicketStatus::orderBy('ticketstatus_position', 'asc')->get();

        //get stats before other filters has been applied
        $stats = $this->statsWidget();

          // Fetch team users (add this line)
        $teamUsers = \App\Models\User::where('type', 'team')->get();
---
select * from `users` where `type` = 'team'

    private function statsWidget($data = array()) {

        //default values
        $stats = [];

        $statuses = \App\Models\TicketStatus::orderBy('ticketstatus_position', 'asc')->get();

        foreach ($statuses as $status) {
            $stat = [
                'value' => \App\Models\Ticket::where('ticket_status', $status->ticketstatus_id)->count(),
                'title' => runtimeLang($status->ticketstatus_title),
                'percentage' => '100%',
                'color' => 'bg-' . $status->ticketstatus_color,
            ];
---
select count(*) as aggregate from `tickets` where `ticket_status` = 1