application/app/Http/Controllers/TicketController.php

select `first_name` from `users` where `id` in ('1')
---
     public function index()
     {
         // Fetch all tickets ordered by 'id' in descending order
         $tickets = CustomTicket::orderby('id', 'DESC')->get();

         $page = $this->pageSettings('tickets');

         // Initialize an array to store user names associated with each ticket
         $users = [];

         // Iterate through each ticket to fetch assigned user names
         foreach ($tickets as $ticket) {
             // Decode the assigned column for each ticket
             $assignedUserIds = json_decode($ticket->assigned, true);

             if (is_array($assignedUserIds)) {
                 // Fetch the user names for the decoded user IDs
                 $users[$ticket->id] = User::whereIn('id', $assignedUserIds)->pluck('first_name')->toArray();