application/app/BootHelper.php

function middlewareBootSettings() {

    //do not run this for SETUP path
    if (env('SETUP_STATUS') != 'COMPLETED') {
        //skip this provider
        return;
    }

    //save system settings into config array


    $settings = \App\Models\Settings::leftJoin('settings2', 'settings2.settings2_id', '=', 'settings.settings_id')
        ->Where('settings_id', 1)
        ->first();
---
select * from `settings` left join `settings2` on `settings2`.`settings2_id` = `settings`.`settings_id` where `settings_id` = 1 limit 1

    $settings['cronjob_path'] = '/usr/local/bin/php ' . BASE_DIR . '/application/artisan schedule:run >> /dev/null 2>&1';

    //all team members
    $settings['team_members'] = \App\Models\User::Where('type', 'team')->Where('status', 'active')->get();

    //the main admin user
    $settings['main_admin_user'] = \App\Models\User::Where('id', 1)->first();
---
select * from `users` where `type` = 'team' and `status` = 'active'
select * from `users` where `id` = 1 limit 1

    //save once to config
    config(['system' => $settings]);

    $categories = \App\Models\Category::Where('category_type', 'project')->orderBy('category_name', 'asc')->get();
---
select * from `categories` where `category_type` = 'project' order by `category_name` asc

function middlewareBootMail() {

    //do not run this for SETUP path
    if (env('SETUP_STATUS') != 'COMPLETED') {
        return;
    }

    //get settings
    $settings = \App\Models\Settings::find(1);

    //defaults
    $email_signature = '';
    $email_footer = '';

    //get email signature
    if ($template = \App\Models\EmailTemplate::Where('emailtemplate_name', 'Email Signature')->first()) {
        $email_signature = $template->emailtemplate_body;
    }

    //get email footer
    if ($template = \App\Models\EmailTemplate::Where('emailtemplate_name', 'Email Footer')->first()) {
---
select * from `settings` where `settings`.`settings_id` = 1 limit 1
select * from `email_templates` where `emailtemplate_name` = 'Email Signature' limit 1
select * from `email_templates` where `emailtemplate_name` = 'Email Footer' limit 1

function middlewareSaaSBootMail() {

    //get tenant settings
    $settings = \App\Models\Settings::find(1);

    //get landlord settings
    $landlord_settings = \App\Models\Landlord\Settings::On('landlord')->Where('settings_id', 'default')->first();

    //defaults
    $email_signature = '';
    $email_footer = '';

    //get email signature
    if ($template = \App\Models\EmailTemplate::Where('emailtemplate_name', 'Email Signature')->first()) {
        $email_signature = $template->emailtemplate_body;
    }

    //get email footer
    if ($template = \App\Models\EmailTemplate::Where('emailtemplate_name', 'Email Footer')->first()) {
---
select * from `settings` where `settings`.`settings_id` = 1 limit 1
select * from `settings` where `settings_id` = 'default' limit 1
select * from `email_templates` where `emailtemplate_name` = 'Email Signature' limit 1
select * from `email_templates` where `emailtemplate_name` = 'Email Footer' limit 1

function middlewareBootTheme() {

    //do not run this for SETUP path
    if (env('SETUP_STATUS') != 'COMPLETED') {
        //set default theme
        config([
            'theme.selected_theme_css' => 'public/themes/default/css/style.css?v=1',
        ]);
        //skip this provider
        return;
    }

    //get settings
    $settings = \App\Models\Settings::find(1);
---
select * from `settings` where `settings`.`settings_id` = 1 limit 1